Hi Chris,
   Here are the steps:

1. Delete two links - output after apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.apstra_datacenter_interfaces_by_link_tag.DC1_AP_VNET_VDI_SERVER_GROUP_1 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_datacenter_interfaces_by_link_tag" "DC1_AP_VNET_VDI_SERVER_GROUP_1" {
      + blueprint_id = "558b40a1-59ef-4a30-ad4e-9d6c054577ae"
      + graph_query  = (known after apply)
      + ids          = (known after apply)
      + tags         = [
          + "VNET_VDI_SERVER_GROUP_1",
        ]
    }

  # apstra_datacenter_connectivity_template_assignments.DC1_VNET_VDI_SERVER_GROUP_1 will be updated in-place
  ~ resource "apstra_datacenter_connectivity_template_assignments" "DC1_VNET_VDI_SERVER_GROUP_1" {
      ~ application_point_ids    = [
          - "jsSYU3UZmtR6HljdGnk",
        ] -> (known after apply)
      + ip_link_ids              = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # apstra_datacenter_connectivity_template_assignments.DC1_VNET_VDI_SERVER_GROUP_1_NFS will be destroyed
  # (because apstra_datacenter_connectivity_template_assignments.DC1_VNET_VDI_SERVER_GROUP_1_NFS is not in configuration)
  - resource "apstra_datacenter_connectivity_template_assignments" "DC1_VNET_VDI_SERVER_GROUP_1_NFS" {
      - application_point_ids    = [
          - "cgMi-20rUylrfPt7yhg",
        ] -> null
      - blueprint_id             = "558b40a1-59ef-4a30-ad4e-9d6c054577ae" -> null
      - connectivity_template_id = "11949259-638e-11ef-81f0-617073747261" -> null
    }

  # apstra_datacenter_generic_system.DC1_LABS92135 will be updated in-place
  ~ resource "apstra_datacenter_generic_system" "DC1_LABS92135" {
        id                   = "EJubKRuzZmA48mvR-44"
      ~ links                = [
          - {
              - group_label                   = "LABS92135_bond1" -> null
              - lag_mode                      = "lacp_active" -> null
              - tags                          = [
                  - "10G",
                  - "SERVER",
                  - "VNET_VDI_SERVER_GROUP_1_NFS",
                ] -> null
              - target_switch_id              = "Zx82yoWoOYIeqXpQsaU" -> null
              - target_switch_if_name         = "xe-0/0/1" -> null
              - target_switch_if_transform_id = 2 -> null
            },
          - {
              - group_label                   = "LABS92135_bond1" -> null
              - lag_mode                      = "lacp_active" -> null
              - tags                          = [
                  - "10G",
                  - "SERVER",
                  - "VNET_VDI_SERVER_GROUP_1_NFS",
                ] -> null
              - target_switch_id              = "ypPvIFe-rU-GS5yRoRY" -> null
              - target_switch_if_name         = "xe-0/0/1" -> null
              - target_switch_if_transform_id = 2 -> null
            },
            # (2 unchanged elements hidden)
        ]
        name                 = "LABS92135"
        tags                 = [
            "SERVER",
        ]
        # (7 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

apstra_datacenter_connectivity_template_assignments.DC1_VNET_VDI_SERVER_GROUP_1_NFS: Destroying...
yeapstra_datacenter_connectivity_template_assignments.DC1_VNET_VDI_SERVER_GROUP_1_NFS: Destruction complete after 2s
apstra_datacenter_generic_system.DC1_LABS92135: Modifying... [id=EJubKRuzZmA48mvR-44]
apstra_datacenter_generic_system.DC1_LABS92135: Modifications complete after 1s [id=EJubKRuzZmA48mvR-44]
data.apstra_datacenter_interfaces_by_link_tag.DC1_AP_VNET_VDI_SERVER_GROUP_1: Reading...
data.apstra_datacenter_interfaces_by_link_tag.DC1_AP_VNET_VDI_SERVER_GROUP_1: Read complete after 0s

Apply complete! Resources: 0 added, 1 changed, 1 destroyed.

2. Re-added links and executed terraform apply


Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.apstra_datacenter_interfaces_by_link_tag.DC1_AP_VNET_VDI_SERVER_GROUP_1 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_datacenter_interfaces_by_link_tag" "DC1_AP_VNET_VDI_SERVER_GROUP_1" {
      + blueprint_id = "558b40a1-59ef-4a30-ad4e-9d6c054577ae"
      + graph_query  = (known after apply)
      + ids          = (known after apply)
      + tags         = [
          + "VNET_VDI_SERVER_GROUP_1",
        ]
    }

  # data.apstra_datacenter_interfaces_by_link_tag.DC1_AP_VNET_VDI_SERVER_GROUP_1_NFS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_datacenter_interfaces_by_link_tag" "DC1_AP_VNET_VDI_SERVER_GROUP_1_NFS" {
      + blueprint_id = "558b40a1-59ef-4a30-ad4e-9d6c054577ae"
      + graph_query  = (known after apply)
      + ids          = (known after apply)
      + tags         = [
          + "VNET_VDI_SERVER_GROUP_1_NFS",
        ]
    }

  # apstra_datacenter_connectivity_template_assignments.DC1_VNET_VDI_SERVER_GROUP_1 will be updated in-place
  ~ resource "apstra_datacenter_connectivity_template_assignments" "DC1_VNET_VDI_SERVER_GROUP_1" {
      ~ application_point_ids    = [
          - "jsSYU3UZmtR6HljdGnk",
        ] -> (known after apply)
      + ip_link_ids              = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # apstra_datacenter_connectivity_template_assignments.DC1_VNET_VDI_SERVER_GROUP_1_NFS will be created
  + resource "apstra_datacenter_connectivity_template_assignments" "DC1_VNET_VDI_SERVER_GROUP_1_NFS" {
      + application_point_ids    = (known after apply)
      + blueprint_id             = "558b40a1-59ef-4a30-ad4e-9d6c054577ae"
      + connectivity_template_id = "11949259-638e-11ef-81f0-617073747261"
      + ip_link_ids              = (known after apply)
    }

  # apstra_datacenter_generic_system.DC1_LABS92135 must be replaced
-/+ resource "apstra_datacenter_generic_system" "DC1_LABS92135" {
      ~ id                   = "EJubKRuzZmA48mvR-44" -> (known after apply)
      ~ links                = [
          + { # forces replacement
              + group_label                   = "LABS92135_bond1"
              + lag_mode                      = "lacp_active"
              + tags                          = [
                  + "10G",
                  + "SERVER",
                  + "VNET_VDI_SERVER_GROUP_1_NFS",
                ]
              + target_switch_id              = "Zx82yoWoOYIeqXpQsaU"
              + target_switch_if_name         = "xe-0/0/1"
              + target_switch_if_transform_id = 2
            },
          + { # forces replacement
              + group_label                   = "LABS92135_bond1"
              + lag_mode                      = "lacp_active"
              + tags                          = [
                  + "10G",
                  + "SERVER",
                  + "VNET_VDI_SERVER_GROUP_1_NFS",
                ]
              + target_switch_id              = "ypPvIFe-rU-GS5yRoRY"
              + target_switch_if_name         = "xe-0/0/1"
              + target_switch_if_transform_id = 2
            },
            # (2 unchanged elements hidden)
        ]
        name                 = "LABS92135"
        tags                 = [
            "SERVER",
        ]
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

apstra_datacenter_generic_system.DC1_LABS92135: Destroying... [id=EJubKRuzZmA48mvR-44]
apstra_datacenter_generic_system.DC1_LABS92135: Destruction complete after 4s
apstra_datacenter_generic_system.DC1_LABS92135: Creating...
apstra_datacenter_generic_system.DC1_LABS92135: Creation complete after 4s [id=shwSci-s3MrfVrt43_U]
data.apstra_datacenter_interfaces_by_link_tag.DC1_AP_VNET_VDI_SERVER_GROUP_1: Reading...
data.apstra_datacenter_interfaces_by_link_tag.DC1_AP_VNET_VDI_SERVER_GROUP_1_NFS: Reading...
data.apstra_datacenter_interfaces_by_link_tag.DC1_AP_VNET_VDI_SERVER_GROUP_1: Read complete after 0s
data.apstra_datacenter_interfaces_by_link_tag.DC1_AP_VNET_VDI_SERVER_GROUP_1_NFS: Read complete after 0s
apstra_datacenter_connectivity_template_assignments.DC1_VNET_VDI_SERVER_GROUP_1_NFS: Creating...
apstra_datacenter_connectivity_template_assignments.DC1_VNET_VDI_SERVER_GROUP_1: Modifying...
apstra_datacenter_connectivity_template_assignments.DC1_VNET_VDI_SERVER_GROUP_1_NFS: Creation complete after 1s
╷
│ Error: failed while assigning Connectivity Template "11948f39-638e-11ef-81f0-617073747261" to Application Points
│ 
│   with apstra_datacenter_connectivity_template_assignments.DC1_VNET_VDI_SERVER_GROUP_1,
│   on 03_ct_internal_generic_systems_assignment.tf line 6, in resource "apstra_datacenter_connectivity_template_assignments" "DC1_VNET_VDI_SERVER_GROUP_1":
│    6: resource "apstra_datacenter_connectivity_template_assignments" "DC1_VNET_VDI_SERVER_GROUP_1" {
│ 
│ {"api_response":null,"config_blueprint_version":0,"errors":{"application_points":{"1":{"policies":{"0":"Not a valid application point"}}}},"error_code":422} - http response '' at
│ 'http://apstra-lab/api/blueprints/558b40a1-59ef-4a30-ad4e-9d6c054577ae/obj-policy-batch-apply?async=full&async=full'
╵



3. Terraform Apply once agin - without any changes.

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # apstra_datacenter_connectivity_template_assignments.DC1_VNET_VDI_SERVER_GROUP_1 will be updated in-place
  ~ resource "apstra_datacenter_connectivity_template_assignments" "DC1_VNET_VDI_SERVER_GROUP_1" {
      ~ application_point_ids    = [
          + "FNP-dXYYCPyVXG9FVvY",
        ]
      + ip_link_ids              = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

apstra_datacenter_connectivity_template_assignments.DC1_VNET_VDI_SERVER_GROUP_1: Modifying...
apstra_datacenter_connectivity_template_assignments.DC1_VNET_VDI_SERVER_GROUP_1: Modifications complete after 1s

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.